package Task_1;

/*
На языке программирования Java создать следующую иерархию школьников:
1. Младшеклассник, у которого реализовать следующие методы:
1.1 Учиться, выводящий на экран фразу "Я люблю учиться"
1.2.  Играть, выводящий на экран фразу "Я играю в игрушки"
1.3. Ходить в продлёнку, выводящий на экран фразу "Я хожу в продлёнку"
2. Ученик средней школы, у которого реализовать следующие методы:
2.1 Учиться, выводящий на экран фразу "Я ненавижу учиться"
2.2. Играть, выводящий на экран фразу "Я играю в Minecraft"
2.3. Курить, выводящий на экран фразу "Я начинаю курить"
3. Старшеклассник, у которого реализовать следующие методы:
3.1. Учиться, выводящий на экран фразу "Я должен учиться"
3.2. Курить, выводящий на экран фразу "Я бросаю курить"
3.3.  Влюбляться, выводящий на экран фразу "Я ищу любовь"
В классе Program реализовать метод, вызывающий все метода переданного объекта-школьника,
а в методе main создать массив школьников, и для каждого элемента массива вызывать указанный метод класса Program
 */
public class Program {
    public static void main(String[] args) {
        Schoolkid[] schoolkids = new Schoolkid[]{
                new YongSchoolkid("Ваня Иванов", 7, "м", "1А"),
                new MiddleSchoolkid("Петя Петров", 11, "м", "5Б"),
                new HighSchoolkid("Коля Колянов", 15, "м", "10В"),
        };

        doSomething(schoolkids);
    }

    static void doSomething(Schoolkid[] schoolkids){
        for (Schoolkid schoolkid : schoolkids) {
            System.out.println(schoolkid);
            String[] arr = schoolkid.getAllMethodsResult();
            for (String res : arr) {
                System.out.println(res);
            }
            System.out.println();
        }
    }
}
