# 3. Напишите программу, которая определит позицию второго
# вхождения строки в списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1


my_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]

my_str = "qwe"

if my_list.count(my_str) >= 2:
    first = my_list.index(my_str)
    second = my_list.index(my_str, first + 1)
    print(f'Ответ: {second}')
else:
    print(f'Ответ: -1')