# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.

# *Пример:* 

# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

data = [1, 2, 3, 5, 1, 5, 3, 10]
new_data = []
new_data = [x for x in data if x not in new_data]
print(new_data)